; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v5 - type_2 ?v6 - type_1)
 	      (pred_3 ?v4 - object ?v6 - type_1)
	      (pred_1 ?v5 - type_2 ?v8 - type_3)
	      (pred_2 ?v5 - type_2 ?v4 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v5 - type_2 ?v3 ?v2 - type_1)
       :precondition (and  (pred_4 ?v5 ?v3))
       :effect (and  (pred_4 ?v5 ?v2)
		     (not (pred_4 ?v5 ?v3))))

   (:action op_3
       :parameters (?v5 - type_2 ?v1 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v7) (pred_4 ?v5 ?v7) (pred_1 ?v5 ?v8))
       :effect (and (pred_2 ?v5 ?v1 ?v8)
		    (not (pred_3 ?v1 ?v7)) 
		    (not (pred_1 ?v5 ?v8))))

   (:action op_2
       :parameters (?v5 - type_2 ?v1 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v1 ?v8) (pred_4 ?v5 ?v7))
       :effect (and (pred_3 ?v1 ?v7)
		    (pred_1 ?v5 ?v8)
		    (not (pred_2 ?v5 ?v1 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_12 obj_06 - type_2
obj_08 obj_11 obj_13 obj_02 - type_3
obj_14 obj_03 obj_01 obj_05 - type_1
obj_10 obj_09 obj_07 obj_04 - object)
(:init
(pred_4 obj_12 obj_05)
(pred_1 obj_12 obj_08)
(pred_1 obj_12 obj_11)
(pred_4 obj_06 obj_14)
(pred_1 obj_06 obj_13)
(pred_1 obj_06 obj_02)
(pred_3 obj_10 obj_05)
(pred_3 obj_09 obj_14)
(pred_3 obj_07 obj_05)
(pred_3 obj_04 obj_01)
)
(:goal
(and
(pred_3 obj_10 obj_14)
(pred_3 obj_09 obj_05)
(pred_3 obj_07 obj_03)
(pred_3 obj_04 obj_01)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_12 obj_05) (pred_4 obj_06 obj_05))))
  )
)
)

; plan
1. (op_3 obj_06 obj_09 obj_14 obj_02)
   deleted: (pred_3 obj_09 obj_14) (pred_1 obj_06 obj_02)
   added: (pred_2 obj_06 obj_09 obj_02)
   goals met: 1 of 4
2. (op_3 obj_12 obj_07 obj_05 obj_11)
   deleted: (pred_3 obj_07 obj_05) (pred_1 obj_12 obj_11)
   added: (pred_2 obj_12 obj_07 obj_11)
   goals met: 1 of 4
3. (op_3 obj_12 obj_10 obj_05 obj_08)
   deleted: (pred_3 obj_10 obj_05) (pred_1 obj_12 obj_08)
   added: (pred_2 obj_12 obj_10 obj_08)
   goals met: 1 of 4
4. (op_1 obj_12 obj_05 obj_03)
   deleted: (pred_4 obj_12 obj_05)
   added: (pred_4 obj_12 obj_03)
   goals met: 1 of 4
5. (op_1 obj_06 obj_14 obj_05)
   deleted: (pred_4 obj_06 obj_14)
   added: (pred_4 obj_06 obj_05)
   goals met: 1 of 4
6. (op_2 obj_06 obj_09 obj_05 obj_02)
   deleted: (pred_2 obj_06 obj_09 obj_02)
   added: (pred_3 obj_09 obj_05) (pred_1 obj_06 obj_02)
   goals met: 2 of 4
7. (op_2 obj_12 obj_07 obj_03 obj_11)
   deleted: (pred_2 obj_12 obj_07 obj_11)
   added: (pred_3 obj_07 obj_03) (pred_1 obj_12 obj_11)
   goals met: 3 of 4
8. (op_1 obj_12 obj_03 obj_14)
   deleted: (pred_4 obj_12 obj_03)
   added: (pred_4 obj_12 obj_14)
   goals met: 3 of 4
9. (op_2 obj_12 obj_10 obj_14 obj_08)
   deleted: (pred_2 obj_12 obj_10 obj_08)
   added: (pred_3 obj_10 obj_14) (pred_1 obj_12 obj_08)
   goals met: 4 of 4
